[
  {
    "question": "Why do you want to work for X company?",
    "property": ""
  },
  {
    "question": "Why do you want to leave your current/last company?",
    "property": ""
  },
  {
    "question": "What are you looking for in your next role?",
    "property": ""
  },
  {
    "question": "Tell me about a time when you had a conflict with a co-worker.",
    "property": ""
  },
  {
    "question": "Tell me about a time in which you had a conflict and needed to influence somebody else.",
    "property": ""
  },
  {
    "question": "What project are you currently working on?",
    "property": ""
  },
  {
    "question": "What is the most challenging aspect of your current project?",
    "property": ""
  },
  {
    "question": "What was the most difficult bug that you fixed in the past 6 months?",
    "property": ""
  },
  {
    "question": "How do you tackle challenges? Name a difficult challenge you faced while working on a project, how you overcame it, and what you learned.",
    "property": ""
  },
  {
    "question": "What are you excited about?",
    "property": ""
  },
  {
    "question": "What frustrates you?",
    "property": ""
  },
  {
    "question": "Imagine it is your first day here at the company. What do you want to work on? What features would you improve on?",
    "property": ""
  },
  {
    "question": "What are the most interesting projects you have worked on and how might they be relevant to this company's environment?",
    "property": ""
  },
  {
    "question": "Tell me about a time you had a disagreement with your manager.",
    "property": ""
  },
  {
    "question": "Talk about a project you are most passionate about, or one where you did your best work.",
    "property": ""
  },
  {
    "question": "What does your best day of work look like?",
    "property": ""
  },
  {
    "question": "What is something that you had to push for in your previous projects?",
    "property": ""
  },
  {
    "question": "What is the most constructive feedback you have received in your career?",
    "property": ""
  },
  {
    "question": "What is something you had to persevere at for multiple months?",
    "property": ""
  },
  {
    "question": "Tell me about a time you met a tight deadline.",
    "property": ""
  },
  {
    "question": "If this were your first annual review with our company, what would I be telling you right now?",
    "property": ""
  },
  {
    "question": "Time management has become a necessary factor in productivity. Give an example of a time-management skill you've learned and applied at work.",
    "property": ""
  },
  {
    "question": "Tell me about a problem you've had getting along with a work associate.",
    "property": ""
  },
  {
    "question": "What aspects of your work are most often criticized?",
    "property": ""
  },
  {
    "question": "How have you handled criticism of your work?",
    "property": ""
  },
  {
    "question": "What strengths do you think are most important for your job position?",
    "property": ""
  },
  {
    "question": "What words would your colleagues use to describe you?",
    "property": ""
  },
  {
    "question": "What would you hope to achieve in the first six months after being hired?",
    "property": ""
  },
  {
    "question": "Tell me why you will be a good fit for the position.",
    "property": ""
  }
]